app/controllers/file_managements_controller.rb

  def index
    @files = current_user.file_managements.order('created_at ASC')
---
SELECT `file_managements`.* FROM `file_managements` WHERE `file_managements`.`user_id` = 2 ORDER BY created_at ASC

  def create
    @file = FileManagement.new(file_params)
    @file.user_id = current_user.id
    if @file.save
---
INSERT INTO `file_managements` (`title`, `description`, `attachment`, `created_at`, `updated_at`, `user_id`) VALUES ('first file', 'sdfsdfd', 'test_excel__2_.ods', '2022-04-03 13:08:41.960535', '2022-04-03 13:08:41.960535', 1)

  def destroy
  	@file = FileManagement.find(params[:id])
  	@file.destroy
---
SELECT `file_managements`.* FROM `file_managements` WHERE `file_managements`.`id` = 15 LIMIT 1
DELETE FROM `file_managements` WHERE `file_managements`.`id` = 15

  def download
  	@file = FileManagement.find(params[:id])
---
SELECT `file_managements`.* FROM `file_managements` WHERE `file_managements`.`id` = 2 LIMIT 1

  def set_file
    @file = FileManagement.find(params[:id])
---
SELECT `file_managements`.* FROM `file_managements` WHERE `file_managements`.`id` = 15 LIMIT 1